app/views/inventories/_add_food_inventory.html.erb

      <div class="field">
        <%= f.select :food_id,@foody.collect { |food| [food.food, food.id] }, { :prompt => 'Add food to inventory'},
         class: "form-select mb-3", required: true %>
---
SELECT "foods".* FROM "foods"