app/views/public_recipes/index.html.erb

          <div class="card-footer d-flex justify-content-between">
            <span class="card-text">Total food items: <%= recipe.recipe_foods.length %> </span><br>
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 3]]