app/views/recipes/show.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 3]]
---
</div>
<% if @recipe.recipe_foods.empty? %>