app/controllers/foods_controller.rb

INSERT INTO "foods" ("food", "measurement_unit", "unit_price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["food", "Chapati"], ["measurement_unit", "grams"], ["unit_price", 12], ["created_at", "2022-04-14 21:47:33.290275"], ["updated_at", "2022-04-14 21:47:33.290275"], ["user_id", 1]]
---
  def create
    @food = current_user.foods.new(food_params)

    respond_to do |format|
      if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]
---
  def destroy
    @food = Food.find(params[:id])
    authorize! :destroy, @food
    @food.destroy!