app/controllers/inventory_foods_controller.rb

  def new
    @inventory_food = InventoryFood.new
    @foods = Food.all
    @current_inventory = Inventory.find(params[:inventory_id])
---
SELECT "foods".* FROM "foods"
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @current_inventory = Inventory.find(params[:inventory_id])
    @inventory_food = @current_inventory.inventory_foods.new(inventory_food_params)

    respond_to do |format|
      if @inventory_food.save
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "inventory_foods" ("quantity", "inventory_id", "food_id", "created_at", "updated_at", "user") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["quantity", 21], ["inventory_id", 1], ["food_id", 1], ["created_at", "2022-04-14 21:51:04.536222"], ["updated_at", "2022-04-14 21:51:04.536222"], ["user", nil]]

  def destroy
    @inventory_food = InventoryFood.find(params[:id])
    authorize! :destroy, @inventory_food
    @inventory_food.destroy!
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "inventory_foods" WHERE "inventory_foods"."id" = $1  [["id", 1]]