app/controllers/recipes_controller.rb

SELECT "inventories".* FROM "inventories"
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 3]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @foods = current_user.foods
    @inventories = Inventory.all
    @recipe = current_user.recipes.includes(:recipe_foods).find(params[:id])
    @recipes = Recipe.find(params[:id])

INSERT INTO "recipes" ("name", "preparationTime", "cookingTime", "description", "public", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipe = current_user.recipes.new(recipe_params)

    respond_to do |format|
      if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "recipes" SET "public" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["public", false], ["updated_at", "2022-04-15 08:23:26.800247"], ["id", 3]]
UPDATE "recipes" SET "public" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["public", true], ["updated_at", "2022-04-15 08:22:24.688617"], ["id", 3]]
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.public
      @recipe.update(public: false)
      flash[:notice] = 'You have updated the recipe status to private'
    else
      @recipe.update(public: true)