app/controllers/shopping_lists_controller.rb

  def index
    @inventory = Inventory.find(4)
    @foods = @inventory.inventory_foods.includes(:food)
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1 LIMIT $2  [["inventory_id", 4], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]