app/controllers/shopping_lists_controller.rb

  def index
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]