app/models/inventory.rb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 3]]
---
  def compute_missing_foods(recipe)
    shopping_list = []
    recipe.recipe_foods.each do |recipe_food|